# tap "homebrew/bundle"
# tap "homebrew/cask-fonts"
# tap "homebrew/cask-versions"
tap "parera10/csshx"

# cli tools
brew "parera10/csshx/csshx"
brew "awscli"
brew "bat"
brew "certbot"
brew "checkbashisms"
brew "codespell"
brew "docker"
brew "fzf"
brew "font-jetbrains-mono"
brew "font-jetbrains-mono-nerd-font"
brew "gnupg"
brew "imagemagick"
brew "jq"
brew "luarocks"
brew "lazygit"
brew "mist-cli"
brew "neovim"
brew "node"
brew "opencode"
brew "openssl@3"
# brew "packer"
brew "powerlevel10k"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
# brew "shfmt"
brew "speedtest-cli"
brew "sshpass"
brew "tesseract"
brew "tree"
brew "uv"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "xz"
brew "zlib"

# casks - apps
cask "font-hack-nerd-font"
cask "1password"
# cask "autopkgr"
cask "blockblock"
cask "docker-desktop"
cask "grammarly-desktop"
# cask "google-chrome"
# cask "daisydisk"
# cask "firefox"
cask "hermes"
cask "ghostty"
cask "knockknock"
cask "lulu"
cask "macdown"
cask "notion"
cask "notion-calendar"
cask "omnigraffle"
cask "packages"
cask "postman"
cask "pppc-utility"
cask "private-internet-access"
cask "raycast"
# cask "signal"
cask "suspicious-package"
cask "apparency"
# cask "topnotch"
cask "wireshark"
cask "zen"
