tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "openssl@3"
brew "xz"
brew "certbot"
brew "checkbashisms"
brew "gnupg"
brew "jq"
brew "neovim"
brew "node"
brew "powerlevel10k"
brew "uv""
brew "pyenv"
brew "pyenv-pip-migrate"
brew "pyenv-virtualenv"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "wireshark"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "autopkgr"
cask "firefox"
cask "font-hack-nerd-font"
cask "ghostty"
cask "suspicious-package"
cask "visual-studio-code"
vscode "42crunch.vscode-openapi"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "emroussel.atom-icons"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "kevinrose.vsc-python-indent"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-vscode.atom-keybindings"
vscode "njpwerner.autodocstring"
vscode "prateekmahendrakar.prettyxml"
vscode "redhat.vscode-yaml"
vscode "silasnevstad.gpthelper"
vscode "sleistner.vscode-fileutils"
vscode "timonwong.shellcheck"
vscode "tobiasalthoff.atom-material-theme"
vscode "truman.autocomplate-shell"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
