# tap "homebrew/bundle"
# tap "homebrew/cask-fonts"
# tap "homebrew/cask-versions"
tap "parera10/csshx"
brew "parera10/csshx/csshx"

# dev, code, and env
brew "awscli"
brew "checkbashisms"
brew "codespell"
cask "font-hack-nerd-font"
brew "imagemagick"
brew "jq"
brew "neovim"
brew "node"
brew "packer"
brew "powerlevel10k"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
# brew "shfmt"
brew "sshpass"
brew "tesseract"
brew "tree"
brew "uv"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# apps and cli tools
cask "anka-virtualization"
cask "1password"
cask "autopkgr"
cask "blockblock"
cask "google-chrome"
cask "daisydisk"
cask "firefox"
cask "gitify"
cask "hermes"
cask "ghostty"
cask "knockknock"
cask "lulu"
cask "macdown"
cask "omnigraffle"
cask "packages"
cask "pdf-expert"
cask "postman"
cask "pppc-utility"
cask "private-internet-access"
cask "raycast"
cask "rectangle"
cask "signal"
cask "suspicious-package"
cask "apparency"
cask "ticktick"
cask "topnotch"
brew "wireshark"
brew "mist-cli"
brew "speedtest-cli"
brew "certbot"
brew "gnupg"

# misc
brew "openssl@3"
brew "xz"
brew "zlib"

# vscode and extensions
cask "visual-studio-code"
vscode "streetsidesoftware.code-spell-checker"
vscode "42crunch.vscode-openapi"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "yzhang.markdown-all-in-one"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "emroussel.atom-icons"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "truman.autocomplate-shell"
vscode "timonwong.shellcheck"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "kevinrose.vsc-python-indent"
# vscode "ms-python.black-formatter"
# vscode "ms-python.flake8"
vscode "ms-python.vscode-pylance"
vscode "ms-python.debugpy"
vscode "ms-playwright.playwright"
vscode "ms-python.python"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
# vscode "njpwerner.autodocstring"
vscode "prateekmahendrakar.prettyxml"
vscode "redhat.vscode-yaml"
vscode "redhat.vscode-xml"
vscode "tamasfe.even-better-toml"
vscode "silasnevstad.gpthelper"
vscode "sleistner.vscode-fileutils"
vscode "tobiasalthoff.atom-material-theme"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "tonybaloney.vscode-pets"
# vscode "hashicorp.hcl"
# vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode-remote.remote-ssh-edit"
