tap "cirruslabs/cli"
tap "parera10/csshx"
brew "xz"
brew "openssl@3"
brew "aria2"
brew "awscli"
brew "bat"
brew "certbot"
brew "checkbashisms"
brew "codespell"
brew "diffnav"
brew "difftastic"
brew "docker"
brew "exiftool"
brew "fd"
brew "figlet"
brew "fzf"
brew "gh"
brew "gnupg"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "luarocks"
brew "mas"
brew "mist-cli"
brew "msitools"
brew "neovim"
brew "node"
brew "nvm"
brew "ripgrep"
brew "opencode"
brew "p7zip"
brew "pnpm"
brew "powerlevel10k"
brew "ruby"
brew "shellcheck"
brew "speedtest-cli"
brew "sshpass"
brew "television"
brew "tesseract"
brew "tmux"
brew "tree"
brew "up"
brew "uv"
brew "wireshark"
brew "worktrunk"
brew "yazi"
brew "zlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "cirruslabs/cli/tart"
brew "parera10/csshx/csshx"
cask "1password"
cask "apparency"
cask "boop"
cask "blockblock"
cask "claude-code"
cask "coderabbit"
cask "cursor"
cask "docker-desktop"
cask "firefox"
cask "firefox@developer-edition"
cask "font-hack-nerd-font"
cask "ghostty"
cask "gimp"
cask "grammarly-desktop"
cask "hermes"
cask "knockknock"
cask "low-profile"
cask "lulu"
cask "macdown"
cask "mimestream"
cask "notion"
cask "notion-calendar"
cask "omnigraffle"
cask "packages"
cask "postman"
cask "pppc-utility"
cask "private-internet-access"
cask "raycast"
cask "suspicious-package"
cask "zed"
cask "zen"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "CrystalFetch", id: 6454431289
mas "Developer", id: 640199958
mas "Okta Verify", id: 490179405
mas "Remote Desktop", id: 409907375
mas "Slack", id: 803453959
mas "Windows App", id: 1295203466
uv "beautysh"
uv "cookiecutter"
uv "isort"
uv "numpy"
uv "pre-commit"
uv "ruff"
uv "shellcheck-py"
uv "ty"
